PGM

  /* Exécuter le script Python en utilisant l'environnement virtuel */
  QSH CMD('export HF_TOKEN="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"; +
           /home/NBOUVIER/my_env/bin/python3 /home/NBOUVIER/python2.py > /dev/null 2>&1')

  /* Copier le fichier CSV généré dans la table */
  CPYFRMIMPF FROMSTMF('/home/NBOUVIER/response.csv') TOFILE(NBOUVIER/ANSWER) +
            MBROPT(*REPLACE) RCDDLM(*CRLF) STRDLM(*NONE) FLDDLM(*TAB)

ENDPGM
